Revit 2025 API
IFrameworkElementCreator Interface
 Interface that the Revit UI will call, if present, to construct the FrameworkElement for the pane.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public interface IFrameworkElementCreator
Public Interface IFrameworkElementCreator
public interface class IFrameworkElementCreator
type IFrameworkElementCreator = interface end
The IFrameworkElementCreator type exposes the following members.
Methods
Name | Description
CreateFrameworkElement |  Method called to create the FrameworkElement.
Top
Example
//
// Class implementing the interface used in Revit to
// on demand create the pane UI.
//
internal class BrowserCreator : IFrameworkElementCreator
{
   //
   // Implement the creation call back by returning a
   // new WebBrowser each time the callback is triggered.
   //
   public FrameworkElement CreateFrameworkElement()
   {
      return new WebBrowser();
   }
}
'
' Class implementing the interface used in Revit to
' on demand create the pane UI.
'
Friend Class BrowserCreator
    Implements IFrameworkElementCreator
    '
    ' Implement the creation call back by returning a
    ' new WebBrowser each time the callback is triggered.
    '
    Public Function CreateFrameworkElement() As FrameworkElement Implements IFrameworkElementCreator.CreateFrameworkElement
        Return New WebBrowser()
    End Function
End Class
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
Autodesk.Revit.UI Namespace